In [37]:
import pandas as pd
import numpy as np

In [38]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,np.nan,99,87,np.nan,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female'],
                'Email':['priyang@gmail.com','aadhya@gmail.com',
                        'krisha@gmail.com','vedant@yahoo.com','parshv@hotmail.com',
                         'mittal@yahoo.com','archana@yahoo.com']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [39]:
# 1. Top 3 Rows of the dataset

In [40]:
df1.head(3)

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  priyang@gmail.com
1   Aadhya    NaN  Female   aadhya@gmail.com
2   Krisha   99.0  Female   krisha@gmail.com

In [41]:
# 2. Last 3 Rows of the dataset

In [42]:
df1.tail(3)

      Name  Marks  Gender               Email
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [43]:
# All rows except the last 2 rows

In [44]:
df1.head(-2)

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com

In [45]:
# all rows except the first 3 rows

In [46]:
df1.tail(-3)

      Name  Marks  Gender               Email
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [47]:
# find the shape of our dataset

In [48]:
df1.shape

(7, 4)

In [49]:
print("Number of Rows",df1.shape[0])
print("Number of Columns",df1.shape[1])

Number of Rows 7
Number of Columns 4

In [50]:
df1

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [51]:
df1['Marks'].shape

(7,)

In [52]:
# get information about our dataset

In [53]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   5 non-null      float64
 2   Gender  7 non-null      object
 3   Email   7 non-null      object
dtypes: float64(1), object(3)
memory usage: 356.0+ bytes

In [54]:
# check null values in our dataset

In [55]:
df1.isnull().sum()

Name      0
Marks     2
Gender    0
Email     0
dtype: int64

In [56]:
# get overall statistics about the dataset

In [57]:
df1.describe(include='all')

           Name      Marks  Gender              Email
count         7   5.000000       7                  7
unique        7        NaN       2                  7
top     Priyang        NaN  Female  priyang@gmail.com
freq          1        NaN       4                  1
mean        NaN  93.200000     NaN                NaN
std         NaN   7.628892     NaN                NaN
min         NaN  83.000000     NaN                NaN
25%         NaN  87.000000     NaN                NaN
50%         NaN  98.000000     NaN                NaN
75%         NaN  99.000000     NaN                NaN
max         NaN  99.000000     NaN                NaN

In [58]:
# find unique values from the gender column

In [59]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Email'], dtype='object')

In [60]:
df1['Name'].unique()

array(['Priyang', 'Aadhya', 'Krisha', 'Vedant', 'Parshv', 'Mittal',
       'Archana'], dtype=object)

In [61]:
df1.unique()

AttributeError: 'DataFrame' object has no attribute 'unique'

In [ ]:
# find the number of unique values from the gender column

In [ ]:
df1

In [ ]:
df1['Gender'].nunique()

In [ ]:
df1.nunique()

In [ ]:
# Display count of unique values in gender column

In [ ]:
df1['Gender'].value_counts()

In [ ]:
df1

In [ ]:
# Handling missing values

In [ ]:
df1

In [ ]:
df1.dropna(how='all')

In [ ]:
df1

In [ ]:
df1.fillna(0)

In [ ]:
df1['Marks']=df1['Marks'].fillna(df1['Marks'].mean())

In [ ]:
df1

In [ ]:
df1

In [ ]:
# marks between 80 to 90

In [ ]:
sum((df1['Marks']>=80) & (df1['Marks']<=90))

In [ ]:
sum(df1['Marks'].between(80,90))

In [ ]:
# Name of the students with lowest marks

In [ ]:
df1.columns

In [ ]:
df1[df1['Marks'].min() == df1['Marks']]['Name']

In [ ]:
# Top 5 students by their marks

In [ ]:
df1.columns

In [ ]:
df1.nlargest(5,'Marks')[['Name','Marks']]

In [ ]:
df1.sort_values(by='Marks',ascending=False).head()[['Name','Marks']]

In [ ]:
# Find Avg marks

In [ ]:
df1

In [ ]:
df1['Marks'].mean()

In [ ]:
df1['Marks'].min()

In [ ]:
df1['Marks'].max()

In [ ]:
# Apply Method

In [ ]:
df1

In [ ]:
def marks(x):
  return x//2

In [ ]:
df1['Half_marks']=df1['Marks'].apply(marks)

In [ ]:
df1

In [ ]:
# Map function

In [ ]:
df1

In [ ]:
df1['Gender'].unique()

In [ ]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [ ]:
df1

In [ ]:
df1.drop('Male_Female',axis=1)

In [ ]:
df1

In [ ]:
# inplace

In [ ]:
# sort the dataframe as per the marks column

In [ ]:
df1

In [ ]:
df1.sort_values(by='Marks',ascending=False)

In [ ]:
# Display Name & Marks of the female students

In [ ]:
df1

In [ ]:
df1[df1['Gender']=='Female'][['Name','Marks']]

In [ ]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

In [ ]:
# Rename the marks columns

In [ ]:
df1.rename(columns={'Marks':"Final_Marks"})

In [ ]:
df1

In [ ]:
# concate two dataset

In [ ]:
df1

In [ ]:
df2 = pd.DataFrame({'Name':'Anil','Marks':90,
                    'Gender':'Male','Email':'anil@gmail.com'},index=[0])

In [ ]:
df2

In [ ]:
df3 = pd.concat(df1,df2)

In [ ]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,np.nan,99,87,np.nan,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female'],
                'Email':['priyang@gmail.com','aadhya@gmail.com',
                        'krisha@gmail.com','vedant@yahoo.com','parshv@hotmail.com',
                         'mittal@yahoo.com','archana@yahoo.com']
               }
df1=pd.DataFrame(dict1)
df1

In [ ]:
df2 = pd.DataFrame({'Name':'Anil','Marks':90,
                    'Gender':'Male','Email':'anil@gmail.com'},index=[0])

In [ ]:
df2

In [ ]:
df3 = pd.concat([df1,df2],ignore_index=True)

In [ ]:
df3

In [ ]:
# loc & iloc

In [ ]:
df1.loc[:,'Marks':'Gender']

In [ ]:
df1.iloc[:,3]

In [ ]:
df1

In [ ]:
df1['Name_Marks']=df1['Name'] +','+ df1['Marks'].apply(str)

In [ ]:
df1

In [ ]:
# find the higest avg value as per gender

In [ ]:
df1.groupby('Gender')['Marks'].mean().sort_values().to_frame()

In [ ]:
# what are the top 5 most popular email providers

In [ ]:
df1

In [ ]:
list1 =[]
for email in df1['Email']:
  list1.append(email.split('@')[1])

In [ ]:
#df1['Email'][0].split('@')[1]

In [ ]:
df1['temp']=list1

In [ ]:
df1

In [ ]:
df1['temp'].value_counts()

In [ ]:
df1['Email'].apply(lambda x:x.split('@')[1]).value_counts().head()